app/Views/antrian/v_antrian.php

SELECT *
FROM `antrian`
WHERE `loket_id` = '5'
AND `created_at` = '2022-07-10'
ORDER BY `status` ASC
---
    use Config\Database;

    foreach ($lokets as $loket) :
        $antrian = Database::connect()->table('antrian')
            ->where('loket_id', $loket['id_loket'])
            ->where('created_at', date('Y-m-d'))
            ->orderBy('status', 'asc')
            ->get()->getResultArray();