app/Controllers/Antrian.php

SELECT *
FROM `loket`
JOIN `pelayanan` ON `pelayanan`.`id_pelayanan` = `loket`.`pelayanan_id`
---
    public function index()
    {
        $getLoket = $this->db->table('loket')
            ->join('pelayanan', 'pelayanan.id_pelayanan = loket.pelayanan_id')
            ->get()->getResultArray();