app/Controllers/Loket.php

    public function detail_loket($id_loket, $id_pelayanan)
    {
        $tableAntrian = Database::connect()->table('antrian')
            ->join('loket', 'loket.id_loket = antrian.loket_id', 'left')
            ->where('id_loket', $id_loket)
            ->where('antrian.pelayanan_id', $id_pelayanan)
            ->where('created_at', date('Y-m-d'))
            ->orderBy('status', 'asc');

        $antrian = $tableAntrian->get()->getResultArray();

        $antrianNow = $tableAntrian->where('status', 1)
            ->where('loket_id', $id_loket)
            ->where('pelayanan_id', $id_pelayanan)
            ->where('created_at', date('Y-m-d'))
            ->get()->getFirstRow();

        $loket = Database::connect()->table('loket')
            ->where('id_loket', $id_loket)
            ->get()->getRowArray();
---
SELECT *
FROM `antrian`
LEFT JOIN `loket` ON `loket`.`id_loket` = `antrian`.`loket_id`
WHERE `id_loket` = '5'
AND `antrian`.`pelayanan_id` = '5'
AND `created_at` = '2022-07-10'
ORDER BY `status` ASC
SELECT *
FROM `antrian`
WHERE `status` = 1
AND `loket_id` = '5'
AND `pelayanan_id` = '5'
AND `created_at` = '2022-07-10'
SELECT *
FROM `loket`
WHERE `id_loket` = '5'

    public function tambah_loket()
    {
        // $getLoket = $this->db->join('pelayanan', 'pelayanan.id_pelayanan = loket.pelayanan_id')->get()->getResultArray();
        // $getPelayanan = Database::connect()->table('pelayanan')->get()->getResultArray();
        $getPelayanan = Database::connect()->table('pelayanan')
        ->join('loket', 'loket.pelayanan_id = pelayanan.id_pelayanan', 'left')
        ->where('id_loket', null)
        ->get()->getResultArray();
---
SELECT *
FROM `pelayanan`
LEFT JOIN `loket` ON `loket`.`pelayanan_id` = `pelayanan`.`id_pelayanan`
WHERE `id_loket` IS NULL

    public function proses_tambah_loket()
    {
        if (!$this->validate([
            'nama_loket' => [
                'rules' => ['required', 'is_unique[loket.nama_loket]'],
                'errors' => [
                    'required' => 'Nama Loket wajib diisi.',
                    'is_unique' => 'Nama Loket sudah dipakai, mohon pakai nama lain.',
                ],
            ],
            'pelayanan_id' => [
                'rules' => ['required'],
                'errors' => [
                    'required' => 'Nama Pelayanan wajib diisi!',
                ]
            ]
        ])) {
            session()->setFlashdata('error', $this->validator->listErrors());
            return redirect()->back()->withInput();
        }

        $data_loket = [
            'nama_loket' => ucwords(strtolower($this->request->getPost('nama_loket'))),
            'pelayanan_id' => $this->request->getPost('pelayanan_id')
        ];

        $this->db->insert($data_loket);
---
INSERT INTO `loket` (`nama_loket`, `pelayanan_id`) VALUES ('Loket 1', '5')