app/Views/home.php


        $no++;

        $antrian = Database::connect()->table('antrian')
            ->where('created_at', date('Y-m-d'))
            ->where('loket_id', $value['id_loket'])
            ->where('status', 1)
            ->get()->getRowArray();
---
SELECT *
FROM `antrian`
WHERE `created_at` = '2022-07-10'
AND `loket_id` = '5'
AND `status` = 1